/*
Здесь задаются все константы, названия портов, и т.п.
*/

//разряды индикатора
#define DIGIT1 PORTD.5
#define DIGIT2 PORTD.1
#define DIGIT3 PORTD.0
#define DIGIT4 PORTD.4

//таблица символов
#define SymbolsArray {\
0b11111010,/*0xFA,   //0 */ \
0b10000010,/*0x82,   //1 */ \
0b10111001,/*0xB9,   //2 */ \
0b10101011,/*0xAB,	 //3 */ \
0b11000011,/*0xC3,   //4 */ \
0b01101011,/*0x6B,   //5 */ \
0b01111011,/*0x7B,   //6 */ \
0b10100010,/*0xA2,   //7 */ \
0b11111011,/*0xFB,   //8 */ \
0b11101011,/*0xEB,   //9 */ \
0b00000000,/*0x00,   //blank */ \
0b00000001,/*0x01,   //- */ \
/*0b01110000,//0x70,   //t */ \
0b10011011,/*0x9B,   //d */ \
/*0b01011000,//0x58,   //L */ \
0b01111001 /*0x79    //  */ \
}
                
//температура представлена так:
//-55°C = -550
//-25°C = -250
//-10.1°C = -101
//0°C = 0
//10.1°C = 101
//25°C = 250
//85°C = 850
//125°C = 1250       


#define TLoadOn_Default 280
#define TLoadOn_Min -550
#define TLoadOn_Max 1250

#define DeltaT_Default 10
#define DeltaT_Min 1
#define DeltaT_Max 900
